---
kind: method
id: M:Autodesk.Revit.DB.Structure.RebarUpdateCurvesData.GetHostId
source: html/4f29a5a7-9703-f0d4-9567-4a042d6b927a.htm
---
# Autodesk.Revit.DB.Structure.RebarUpdateCurvesData.GetHostId Method

Gets the id of the host structural for this rebar.

## Syntax (C#)
```csharp
public ElementId GetHostId()
```

## Returns
Returns the id of the host structural for this rebar.